#include<stdio.h>

int main()
{
	double a,b,c,t;
	printf("输入三角形的三条边：a,b,c（用空格隔开）:");
	scanf("%lf%lf%lf",&a,&b,&c);

//-------------------------比较，使a最大--------------------------------
	if(a < b)
	{
		t=b;
		b=a;
		a=t;
	}//a>=b
	if(a < c)
	{
		t=c;
		c=a;
		a=t;
	}
	//a为三者最大

//------------------------判断为何种三角形-----------------------------
	if(c + b > a) 
	{
		//----------------------判断等腰---------------------------
		if(b == c)
		{
			if((a * a) == (b * b + c * c) ) printf("此三角形为等腰直角三角形\n");
			printf("此三角形为等腰三角形\n");
		}

		//---------------------判断直角----------------------------
		else 
		{
			if((a * a) == (b * b + c * c) ) printf("此三角形为直角三角形\n");
			else printf("此三角形为一般三角形\n");
		}
	}

	else printf("不能构成三角形！\n");

	return 0;
}